In [17]:
from google.colab import drive 
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [35]:
import pandas as pd

df_temp=pd.read_csv('gdrive/MyDrive/Data/GlobalLandTemperaturesByCountry.csv') #Temperature df
df_co2=pd.read_csv('gdrive/MyDrive/Data/CO2emissionbycountries.csv',encoding= 'unicode_escape') #CO2 df
df_pop=pd.read_csv('gdrive/MyDrive/Data/Population.csv') #Population df

In [36]:
df_temp.head(5)

           dt  AverageTemperature  AverageTemperatureUncertainty Country
0  1743-11-01               4.384                          2.294   Åland
1  1743-12-01                 NaN                            NaN   Åland
2  1744-01-01                 NaN                            NaN   Åland
3  1744-02-01                 NaN                            NaN   Åland
4  1744-03-01                 NaN                            NaN   Åland

In [37]:
pd.DataFrame(df_temp)

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Åland
1,1743-12-01,NaN,NaN,Åland
2,1744-01-01,NaN,NaN,Åland
3,1744-02-01,NaN,NaN,Åland
4,1744-03-01,NaN,NaN,Åland
...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe
577458,2013-06-01,17.613,0.473,Zimbabwe
577459,2013-07-01,17.000,0.453,Zimbabwe
577460,2013-08-01,19.759,0.717,Zimbabwe
577461,2013-09-01,NaN,NaN,Zimbabwe

In [38]:
df_co2.head(5)

,Country,Code,Calling Code,Year,CO2 emission (Tons),Population(2022),Area,% of World,Density(km2)
0,Afghanistan,AF,93,1750,0.0,41128771.0,652230.0,0.40%,63/km²
1,Afghanistan,AF,93,1751,0.0,41128771.0,652230.0,0.40%,63/km²
2,Afghanistan,AF,93,1752,0.0,41128771.0,652230.0,0.40%,63/km²
3,Afghanistan,AF,93,1753,0.0,41128771.0,652230.0,0.40%,63/km²
4,Afghanistan,AF,93,1754,0.0,41128771.0,652230.0,0.40%,63/km²

In [39]:
#Dropping data with CO2 emission equal 0
df= df_co2[df_co2['CO2 emission (Tons)'] != 0]

In [40]:
print(df)

           Country Code Calling Code  Year  CO2 emission (Tons)  \
199    Afghanistan   AF           93  1949              14656.0
200    Afghanistan   AF           93  1950              98928.0
201    Afghanistan   AF           93  1951             190528.0
202    Afghanistan   AF           93  1952             282128.0
203    Afghanistan   AF           93  1953             388384.0
...            ...  ...          ...   ...                  ...
59615     Zimbabwe   ZW          263  2016          736467042.0
59616     Zimbabwe   ZW          263  2017          746048675.0
59617     Zimbabwe   ZW          263  2018          757903042.0
59618     Zimbabwe   ZW          263  2019          768852126.0
59619     Zimbabwe   ZW          263  2020          779383468.0

       Population(2022)      Area % of World Density(km2)
199          41128771.0  652230.0      0.40%       63/km²
200          41128771.0  652230.0      0.40%       63/km²
201          41128771.0  652230.0      0.40%       63/km²
202          41128771.0  652230.0      0.40%       63/km²
203          41128771.0  652230.0      0.40%       63/km²
...                 ...       ...        ...          ...
59615        16320537.0  390757.0      0.30%       42/km²
59616        16320537.0  390757.0      0.30%       42/km²
59617        16320537.0  390757.0      0.30%       42/km²
59618        16320537.0  390757.0      0.30%       42/km²
59619        16320537.0  390757.0      0.30%       42/km²

[21707 rows x 9 columns]

In [41]:
#Preparing data by dropping duplicates to visualize in which years surveys start.
df_single=df
df_single=df_single.drop_duplicates(subset=['Country'])
print(df_single)

                 Country Code Calling Code  Year  CO2 emission (Tons)  \
199          Afghanistan   AF           93  1949              14656.0
454              Albania   AL          355  1933               7328.0
708              Algeria   DZ          213  1916               3664.0
1053             Andorra   AD          376  1990             406704.0
1284              Angola   AO          244  1950             186864.0
...                  ...  ...          ...   ...                  ...
58407            Vietnam   VN           84  1892             212512.0
58787  Wallis and Futuna   WF          681  2001              14656.0
59007              Yemen   YE          967  1950              58624.0
59278             Zambia   ZM          260  1950            2330187.0
59502           Zimbabwe   ZW          263  1903             113584.0

       Population(2022)       Area % of World Density(km2)
199          41128771.0   652230.0      0.40%       63/km²
454           2842321.0    28748.0      0.00%       99/km²
708          44903225.0  2381741.0      1.60%       19/km²
1053            79824.0      468.0      0.00%      171/km²
1284         35588987.0  1246700.0      0.80%       29/km²
...                 ...        ...        ...          ...
58407        98186856.0   331212.0      0.20%      296/km²
58787               NaN        NaN        NaN          NaN
59007        33696614.0   527968.0      0.40%       64/km²
59278        20017675.0   752612.0      0.50%       27/km²
59502        16320537.0   390757.0      0.30%       42/km²

[220 rows x 9 columns]

In [42]:
#Filtering country with data surveys starting from 1959
df_single = df_single[df_single['Year'] > 1959]
print(df_single)

                        Country Code Calling Code  Year  CO2 emission (Tons)  \
1053                    Andorra   AD          376  1990             406704.0
1595                   Anguilla   AI        1-264  1990              51296.0
1863                 Antarctica   AQ          672  1987               3664.0
6453                     Bhutan   BT          975  1970               3664.0
7268                   Botswana   BW          267  1972              21984.0
11060          Christmas Island   CX           61  1970              69616.0
12143              Cook Islands   CK          682  1969              10992.0
27582                  Kiribati   KI          686  1961               7328.0
27900                    Kosovo   XK          383  2008            7386624.0
29508                   Lesotho   LS          266  1990            1472928.0
30321             Liechtenstein   LI          423  1990             198968.0
32199                  Maldives   MV          960  1971               3664.0
33033          Marshall Islands   MH          692  1992              76944.0
34115                   Mayotte   YT          262  1990              66014.0
34659                Micronesia   FM          691  1992             102592.0
35713                Montserrat   MS        1-664  1962               3664.0
36826                   Namibia  NaN          264  1991            1055232.0
37070                     Nauru   NR          674  1964              29312.0
39244                      Niue   NU          683  1970               3664.0
40322                      Oman   OM          968  1964              10992.0
41161                 Palestine   PS          970  1990             861040.0
44933              Saint Helena  NaN          290  1968               3664.0
45217     Saint Kitts and Nevis   KN        1-869  1981              54960.0
47638                Seychelles   SC          248  1963               7328.0
53639                     Timor   TL          NaN  2002             161216.0
55524  Turks and Caicos Islands   TC        1-649  1990              29312.0
55795                    Tuvalu   TV          688  1990              10992.0
57935                   Vanuatu   VU          678  1962              40304.0
58787         Wallis and Futuna   WF          681  2001              14656.0

       Population(2022)      Area % of World Density(km2)
1053            79824.0     468.0      0.00%      171/km²
1595                NaN      91.0      0.00%          NaN
1863                NaN       NaN        NaN          NaN
6453           782455.0   38394.0      0.00%       20/km²
7268          2630296.0  582000.0      0.40%        5/km²
11060               NaN       NaN        NaN          NaN
12143               NaN     236.0      0.00%          NaN
27582          131232.0     811.0      0.00%      162/km²
27900         1802250.0       NaN        NaN      166/km²
29508         2305825.0   30355.0      0.00%       76/km²
30321           39327.0     160.0      0.00%      246/km²
32199          523787.0     300.0      0.00%    1,746/km²
33033           41569.0     181.0      0.00%      230/km²
34115          326101.0     374.0      0.00%      872/km²
34659          114164.0     702.0      0.00%      163/km²
35713               NaN     102.0      0.00%          NaN
36826         2567012.0  825615.0      0.60%        3/km²
37070           12668.0      21.0      0.00%      603/km²
39244               NaN     260.0      0.00%          NaN
40322         4576298.0  309500.0      0.20%       15/km²
41161         5250072.0       NaN        NaN      844/km²
44933               NaN     394.0      0.00%          NaN
45217           47657.0     261.0      0.00%      183/km²
47638          107118.0     452.0      0.00%      237/km²
53639               NaN       NaN        NaN          NaN
55524               NaN     948.0      0.00%          NaN
55795           11312.0      26.0      0.00%      435/km²
57935          326740.0   12189.0      0.00%       27/km²
58787               NaN       NaN        NaN          NaN

In [43]:
#Left outer join exclusion on country with data surveys starting from 1959
df_final=pd.merge(df,df_single[['Country']],on=['Country'],how="outer",indicator=True)
df_final=df_final[df_final['_merge']=='left_only']
# resetting the DataFrame index
df_final = df_final.reset_index()

In [44]:
df_new=df_final[df_final['Year'] >= 1959]

df_new = df_new.reset_index()

In [45]:
df_new

,level_0,index,Country,Code,Calling Code,Year,CO2 emission (Tons),Population(2022),Area,% of World,Density(km2),_merge
0,10,10,Afghanistan,AF,93,1959,1839179.0,41128771.0,652230.0,0.40%,63/km²,left_only
1,11,11,Afghanistan,AF,93,1960,2253064.0,41128771.0,652230.0,0.40%,63/km²,left_only
2,12,12,Afghanistan,AF,93,1961,2743862.0,41128771.0,652230.0,0.40%,63/km²,left_only
3,13,13,Afghanistan,AF,93,1962,3432456.0,41128771.0,652230.0,0.40%,63/km²,left_only
4,14,14,Afghanistan,AF,93,1963,4139192.0,41128771.0,652230.0,0.40%,63/km²,left_only
...,...,...,...,...,...,...,...,...,...,...,...,...
11837,20533,21702,Zimbabwe,ZW,263,2016,736467042.0,16320537.0,390757.0,0.30%,42/km²,left_only
11838,20534,21703,Zimbabwe,ZW,263,2017,746048675.0,16320537.0,390757.0,0.30%,42/km²,left_only
11839,20535,21704,Zimbabwe,ZW,263,2018,757903042.0,16320537.0,390757.0,0.30%,42/km²,left_only
11840,20536,21705,Zimbabwe,ZW,263,2019,768852126.0,16320537.0,390757.0,0.30%,42/km²,left_only
11841,20537,21706,Zimbabwe,ZW,263,2020,779383468.0,16320537.0,390757.0,0.30%,42/km²,left_only

In [ ]:
df_final.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20538 entries, 0 to 21706
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              20538 non-null  object
 1   Code                 19874 non-null  object
 2   Calling Code         19498 non-null  object
 3   Year                 20538 non-null  int64
 4   CO2 emission (Tons)  20538 non-null  float64
 5   Population(2022)     19378 non-null  float64
 6   Area                 19668 non-null  float64
 7   % of World           19668 non-null  object
 8   Density(km2)         19378 non-null  object
 9   _merge               20538 non-null  category
dtypes: category(1), float64(3), int64(1), object(5)
memory usage: 2.1+ MB

In [46]:
df_new=df_new.drop(columns=['index','level_0','Code','Calling Code','_merge','Area','Population(2022)','% of World'])

In [47]:
df_new.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11842 entries, 0 to 11841
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              11842 non-null  object
 1   Year                 11842 non-null  int64
 2   CO2 emission (Tons)  11842 non-null  float64
 3   Density(km2)         10974 non-null  object
dtypes: float64(1), int64(1), object(2)
memory usage: 370.2+ KB

In [48]:

check_nan =df_new['Density(km2)'].isnull()
print(check_nan)
df_new.loc[df_new['Density(km2)'].isnull()]

# printing the result

0        False
1        False
2        False
3        False
4        False
         ...
11837    False
11838    False
11839    False
11840    False
11841    False
Name: Density(km2), Length: 11842, dtype: bool

                        Country  Year  CO2 emission (Tons) Density(km2)
434                       Aruba  1959           10044560.0          NaN
435                       Aruba  1960           10663121.0          NaN
436                       Aruba  1961           11308674.0          NaN
437                       Aruba  1962           12017616.0          NaN
438                       Aruba  1963           12696704.0          NaN
...                         ...   ...                  ...          ...
9605  Sint Maarten (Dutch part)  2016           64902615.0          NaN
9606  Sint Maarten (Dutch part)  2017           65653735.0          NaN
9607  Sint Maarten (Dutch part)  2018           66375543.0          NaN
9608  Sint Maarten (Dutch part)  2019           67080068.0          NaN
9609  Sint Maarten (Dutch part)  2020           67703530.0          NaN

[868 rows x 4 columns]

In [49]:
df_pop = pd.read_csv('gdrive/MyDrive/Data/population2.csv') #Population df

df_pop = df_pop.drop(columns=['field/0/_name','field/0/_key','field/1/_name','field/1/_key','field/1/__text','field/2/_name','field/3/_name'])
df_pop = df_pop.rename(columns={"field/0/__text": "Country", "field/2/__text": "Year", 'field/3/__text': 'Population'})
df_pop.info(verbose=True)

check_nan =df_pop['Population'].isnull()
print(check_nan)
df_pop.loc[df_pop['Population'].isnull()]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16492 entries, 0 to 16491
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     16492 non-null  object
 1   Year        16492 non-null  int64
 2   Population  16387 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 386.7+ KB
0        False
1        False
2        False
3        False
4        False
         ...
16487    False
16488    False
16489    False
16490    False
16491    False
Name: Population, Length: 16492, dtype: bool

                  Country  Year  Population
4330              Eritrea  2012         NaN
4331              Eritrea  2013         NaN
4332              Eritrea  2014         NaN
4333              Eritrea  2015         NaN
4334              Eritrea  2016         NaN
...                   ...   ...         ...
12177  West Bank and Gaza  1985         NaN
12178  West Bank and Gaza  1986         NaN
12179  West Bank and Gaza  1987         NaN
12180  West Bank and Gaza  1988         NaN
12181  West Bank and Gaza  1989         NaN

[105 rows x 3 columns]

In [73]:
df_pop

df_pc = df_pop.Country.isin(df_new.Country).astype(int)

print(df_pc)
print(df_pc.loc[df_pc==0])

0        1
1        1
2        1
3        1
4        1
        ..
16487    1
16488    1
16489    1
16490    1
16491    1
Name: Country, Length: 16492, dtype: int64

Int64Index([0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            ...
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
           dtype='int64', length=6448)

In [74]:
df_pop

        Country  Year  Population
0         Aruba  1960     54208.0
1         Aruba  1961     55434.0
2         Aruba  1962     56234.0
3         Aruba  1963     56699.0
4         Aruba  1964     57029.0
...         ...   ...         ...
16487  Zimbabwe  2017  14236599.0
16488  Zimbabwe  2018  14438812.0
16489  Zimbabwe  2019  14645473.0
16490  Zimbabwe  2020  14862927.0
16491  Zimbabwe  2021  15092171.0

[16492 rows x 3 columns]